RT-Thread-packages/gd32-risc-v-series/GD32VW55x/RISCV/env_Eclipse/handlers.c
/*
 * Copyright (c) 2019 Nuclei Limited. All rights reserved.
 * Copyright (c) 2025, GigaDevice Semiconductor Inc.
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed under the Apache License, Version 2.0 (the License); you may
 * not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 * www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an AS IS BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 */

/* This file refers the RISC-V standard, some adjustments are made according to GigaDevice chips */

#include "gd32vw55x.h"

#ifndef BSP_USING_WLAN
#define EXEC_USING_STD_PRINTF
#endif /* BSP_USING_WLAN */

#ifndef EXEC_USING_STD_PRINTF
#include "log_uart.h"
#include "rom_export.h"
#include "raw_flash_api.h"
#include "wrapper_os.h"
#define EXC_LOG_TO_FLASH    0
#endif

#define UART_CMD_IN_EXC     1

extern uint32_t _sp[];

typedef struct EXC_Frame {
#ifdef __riscv_flen
    unsigned long f0;
    unsigned long f1;
    unsigned long f2;
    unsigned long f3;
    unsigned long f4;
    unsigned long f5;
    unsigned long f6;
    unsigned long f7;
    unsigned long f10;
    unsigned long f11;
    unsigned long f12;
    unsigned long f13;
    unsigned long f14;
    unsigned long f15;
    unsigned long f16;
    unsigned long f17;
    unsigned long f28;
    unsigned long f29;
    unsigned long f30;
    unsigned long f31;
    unsigned long rcv;               /* pendding for 8-byte alignment */
    unsigned long fcsr;
#endif
    unsigned long ra;                /* ra: x1, return address for jump */
    unsigned long tp;                /* tp: x4, thread pointer */
    unsigned long t0;                /* t0: x5, temporary register 0 */
    unsigned long t1;                /* t1: x6, temporary register 1 */
    unsigned long t2;                /* t2: x7, temporary register 2 */
    unsigned long a0;                /* a0: x10, return value or function argument 0 */
    unsigned long a1;                /* a1: x11, return value or function argument 1 */
    unsigned long a2;                /* a2: x12, function argument 2 */
    unsigned long a3;                /* a3: x13, function argument 3 */
    unsigned long a4;                /* a4: x14, function argument 4 */
    unsigned long a5;                /* a5: x15, function argument 5 */
    unsigned long mcause;            /* mcause: machine cause csr register */
    unsigned long mepc;              /* mepc: machine exception program counter csr register */
    unsigned long msubm;             /* msubm: machine sub-mode csr register, nuclei customized */
#ifndef __riscv_32e
    unsigned long a6;                /* a6: x16, function argument 6 */
    unsigned long a7;                /* a7: x17, function argument 7 */
    unsigned long t3;                /* t3: x28, temporary register 3 */
    unsigned long t4;                /* t4: x29, temporary register 4 */
    unsigned long t5;                /* t5: x30, temporary register 5 */
    unsigned long t6;                /* t6: x31, temporary register 6 */
#endif
} EXC_Frame_Type;

/**
 * \defgroup  NMSIS_Core_IntExcNMI_Handling   Interrupt and Exception and NMI Handling
 * \brief Functions for interrupt, exception and nmi handle available in system_<device>.c.
 * \details
 * Nuclei provide a template for interrupt, exception and NMI handling. Silicon Vendor could adapat according
 * to their requirement. Silicon vendor could implement interface for different exception code and
 * replace current implementation.
 *
 * @{
 */
/** \brief Max exception handler number, don't include the NMI(0xFFF) one */
#define MAX_SYSTEM_EXCEPTION_NUM        12
/**
 * \brief      Store the exception handlers for each exception ID
 * \note
 * - This SystemExceptionHandlers are used to store all the handlers for all
 * the exception codes Nuclei N/NX core provided.
 * - Exception code 0 - 11, totally 12 exceptions are mapped to SystemExceptionHandlers[0:11]
 * - Exception for NMI is also re-routed to exception handling(exception code 0xFFF) in startup code configuration, the handler itself is mapped to SystemExceptionHandlers[MAX_SYSTEM_EXCEPTION_NUM]
 */
static unsigned long SystemExceptionHandlers[MAX_SYSTEM_EXCEPTION_NUM + 1];

/**
 * \brief      Exception Handler Function Typedef
 * \note
 * This typedef is only used internal in this system_<Device>.c file.
 * It is used to do type conversion for registered exception handler before calling it.
 */
typedef void (*EXC_HANDLER)(unsigned long mcause, unsigned long sp);

void Exception_DumpFrame(unsigned long sp);

#ifndef EXEC_USING_STD_PRINTF
static int8_t __hex_to_val(uint8_t c)
{
    if (c >= '0' && c <= '9') {
        return (c - '0');
    } else if(c >= 'a' && c <= 'f') {
        return (c - 'a') + 10;
    } else if(c >= 'A' && c <= 'F') {
        return (c - 'A') + 10;
    } else {
        return -1;
    }
}

static void __print32(uint32_t val)
{
    int8_t i;
    uint8_t c;

    for (i = 7; i >= 0; i --) {
        c = (val >> (i << 2)) & 0xf;
        if (c >= 10)
            c += 'a' - 10;
        else
            c += '0';
        log_uart_putc_noint(c);
    }
}

static void __print_str(const char* s)
{
    char *str = (char *)s;

    while(*str) {
        log_uart_putc_noint(*str);
        str++;
    }
}

void print_reg(const char *title, uint32_t val)
{
    __print_str(title);
    __print_str(":      0x");
    __print32(val);
    __print_str("\r\n");
}

void dumpStackInfo(unsigned long sp, int32_t num)
{
    uint32_t i = 0;
    int8_t j = 0;
    char c;

    while(num > 0)
    {
        uint8_t val = *(uint8_t *)sp;
        for (j = 4; j >= 0; j -= 4) {
            c = ((val >> j ) & 0xF);
            if (c >= 10)
                c += 'a' - 10;
            else
                c += '0';
            log_uart_putc_noint(c);
        }


        i++;
        sp++;
        if ((i % 16) == 0) {
            __print_str("\r\n");
        }
        else {
            log_uart_putc_noint(',');
            log_uart_putc_noint(' ');
        }

