RT-Thread-packages/gd32-risc-v-series/GD32VW55x/RISCV/env_Eclipse/handlers.c
        num--;
    }
}

void xCurrentTaskDumpInfo(unsigned long sp)
{
    int8_t j = 0;
    char *pcTaskName = sys_task_name_get(NULL);
    int32_t num = sys_current_task_stack_depth(sp);
#if (configRECORD_STACK_HIGH_ADDRESS == 0)
    __print_str("set configRECORD_STACK_HIGH_ADDRESS=1 to get precise data\r\n");
#endif
    __print_str((const char *)pcTaskName);

    __print_str(" Stack Dump:\r\n");

    dumpStackInfo(sp, num);
}


static bool parseUartCmd(char *p_buf, uint8_t buf_len, unsigned long sp) {
    uint8_t idx = 0;
    uint8_t state = 0;
    uint32_t start_addr = 0;
    uint32_t len = 0;
    int32_t i;
    uint32_t val;
    int8_t val8;
    char cmdr[] = {'r', 'm', 'e', 'm', ' '};
    char cmdd[] = {'d', 'u', 'm', 'p'};
    char cmdh[] = {'h', 'e', 'l', 'p'};

    while(idx < buf_len) {
        switch (state) {
        case 0:
            if (p_buf[idx] == 'r' && (buf_len - idx) > 5) {
                for (i = 0; i < 5; i++) {
                    if (p_buf[idx] != cmdr[i]) {
                        return false;
                    }
                    idx++;
                }

                state = 1;
                continue;
            }
            else if (p_buf[idx] == 'd' && (buf_len - idx) >= 4) {
                for (i = 0; i < 4; i++) {
                    if (p_buf[idx] != cmdd[i]) {
                        return false;
                    }
                    idx++;
                }
                Exception_DumpFrame(sp);
                // Trap from task
                if ((MSUBM_PTYP & __RV_CSR_READ(CSR_MSUBM)) == 0) {
                    print_reg("SP     ", sp);
                    xCurrentTaskDumpInfo(sp);
                }
                // Trap from interrupt
                else if ((MSUBM_PTYP & __RV_CSR_READ(CSR_MSUBM)) == 0x0100) {
                    unsigned long int_sp = __RV_CSR_READ(CSR_MSCRATCH);
                    print_reg("SP     ", int_sp);
#ifndef __riscv_32e
                    int32_t num = 80;
#else
                    int32_t num = 64;
#endif

#ifdef __riscv_flen
                    num += 80;
#endif
                    __print_str("Interrupt Stack Dump:\r\n");
                    dumpStackInfo(sp, num);
                    num = (uint32_t)_sp - int_sp;
                    dumpStackInfo(int_sp, num);
                }

                __print_str("Please use bloodhound tool to parse log above!\r\n");
                return true;
            }
            else if (p_buf[idx] == 'h' && (buf_len - idx) >= 4) {
                for (i = 0; i < 4; i++) {
                    if (p_buf[idx] != cmdh[i]) {
                        return false;
                    }
                    idx++;
                }
                __print_str("rmem ADDR(Hex 4bytes align) Len(Hex length of 4 bytes)\r\n");
                __print_str("dump\r\n");

                return true;
            }
            break;
        case 1:
            if (p_buf[idx] == ' ') {
                state = 2;
                break;
            }

            val8 = __hex_to_val(p_buf[idx]);

            if (val8 < 0)
                return false;
            else
                start_addr = (start_addr << 4) + val8;

            break;
        case 2:
            if (p_buf[idx] == ' ') {
                break;
            }

            val8 = __hex_to_val(p_buf[idx]);
            if (val8 < 0)
                return false;
            else
                len = (len << 4) + val8;

        default:
            break;
        }
        idx++;
    }

    // we need to check read addr is ok
    i = 0;
    do {
        val = *(uint32_t *)start_addr;

        if ((i % 4) == 0) {
            __print_str("\r\n");
            __print32(start_addr);
            log_uart_putc_noint(':');
        }

        log_uart_putc_noint(' ');
        __print32(val);

        start_addr = start_addr + 4;
    } while(++i < len);

    return true;
}
#endif

#if EXC_LOG_TO_FLASH
#define WR_REGION_SPAGE    ((uint32_t)0x003FE000U)       /*!< start page of write protection region: page1022 */
#define WR_REGION_EPAGE    ((uint32_t)0x003FF000U)       /*!< end page of write protection region: page1023 */

static void dump_info_2_flash(unsigned long sp)
{
    char prefix[3];
    uint32_t reg_val = 0;
    uint32_t offset = WR_REGION_SPAGE;

    if (raw_flash_erase(WR_REGION_SPAGE, FLASH_PAGE_SIZE))
        return;

    prefix[0] = 20;
    prefix[1] = 0;
    prefix[2] = 0x01;   //register value
    raw_flash_write(offset, (void *)&prefix, 3);
    offset += 3;

    reg_val = __RV_CSR_READ(CSR_MCAUSE);
    raw_flash_write(offset, (void *)&reg_val, 4);
    offset += 4;

    reg_val = __RV_CSR_READ(CSR_MDCAUSE);
    raw_flash_write(offset, (void *)&reg_val, 4);
    offset += 4;

    reg_val = __RV_CSR_READ(CSR_MEPC);
    raw_flash_write(offset, (void *)&reg_val, 4);
    offset += 4;

    reg_val = __RV_CSR_READ(CSR_MTVAL);
    raw_flash_write(offset, (void *)&reg_val, 4);
    offset += 4;

    reg_val = __RV_CSR_READ(CSR_MSUBM);
    raw_flash_write(offset, (void *)&reg_val, 4);
    offset += 4;

    prefix[2] = 0x02;   //stack type
    // Trap from task
    if ((MSUBM_PTYP & __RV_CSR_READ(CSR_MSUBM)) == 0) {
        int32_t num = sys_current_task_stack_depth(sp);
        if ((offset + num + 6) > WR_REGION_EPAGE) {
            num = WR_REGION_EPAGE - offset - 6;
        }
        prefix[0] = num & 0xFF;
        prefix[1] = (num >> 8) & 0xFF;
        raw_flash_write(offset, (void *)prefix, 3);
        offset += 3;
        raw_flash_write(offset, (void *)sp, num);
        offset += num;
    }
    // Trap from interrupt
    else if ((MSUBM_PTYP & __RV_CSR_READ(CSR_MSUBM)) == 0x0100) {
          unsigned long int_sp = __RV_CSR_READ(CSR_MSCRATCH);
          int32_t sk_num = (uint32_t)_sp - int_sp;
#ifndef __riscv_32e
        int32_t num = 80;
#else
        int32_t num = 64;
#endif

#ifdef __riscv_flen
        num += 80;
#endif

        if ((offset + num + sk_num + 6) > WR_REGION_EPAGE) {
            sk_num = WR_REGION_EPAGE - offset - 6 - num;
        }

